Revit 2026 API

# PlanTopology Class

---

An object that represents a Plan Topology within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPlanTopology

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PlanTopology : APIObject
```
```vb
Public Class PlanTopology
	Inherits APIObject
```
```cpp
public ref class PlanTopology : public APIObject
```
```fsharp
type PlanTopology =
    class
        inherit APIObject
    end
```

The PlanTopology type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Circuits | The Circuits of the PlanTopology. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Level | The Level of the PlanTopology. |
|  | Phase | The phase of the PlanTopology. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRoomIds | Retrieves room ElementIds of the PlanTopology in the last phase. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This object derived from the APIObject base object. It can be used access the properties of a Plan Topology.

#### Reference

Autodesk.Revit.DB Namespace